**Step-11:How to Save the Dataframe**

- we can save the dataframe using 2 ways
- csv : comma seperated value excel
- For csv : .to_csv extention=.csv
- For excel: .to_excel extention=.xlsx

**don't change anything in this**

In [6]:
import pandas as pd

In [8]:
# Create a Dataframe
name=['Raj','Abhi','Chinna']
age =[20,21,22]
city =['Pune','Hyd','Delhi']
cols=['Names','Age','City']
id=['A','B','C']
df=pd.DataFrame(zip(name,age,city),index=id,columns=cols)
df

    Names  Age   City
A     Raj   20   Pune
B    Abhi   21    Hyd
C  Chinna   22  Delhi

**step-12 Save in CSV format**

In [11]:
df.to_csv('data.csv')

In [13]:
df.to_excel('data.xlsx')

**Step-12 : Read the data**
-read_csv
- read_excel
- both availabel on pandas

In [16]:
pd.read_csv('data.csv')

  Unnamed: 0   Names  Age   City
0          A     Raj   20   Pune
1          B    Abhi   21    Hyd
2          C  Chinna   22  Delhi

In [18]:
pd.read_excel('data.xlsx')

  Unnamed: 0   Names  Age   City
0          A     Raj   20   Pune
1          B    Abhi   21    Hyd
2          C  Chinna   22  Delhi

**Step-13: How to avoid extra column**
- while we are saving the data, we have argument name index
- keep index=False

In [21]:
# Give the differnt name, provide index= False
df.to_csv('data11.csv',index=False)
pd.read_csv('data11.csv')

    Names  Age   City
0     Raj   20   Pune
1    Abhi   21    Hyd
2  Chinna   22  Delhi